// Задание 1: три способа обьявления переменных

// 1. var (устаревший способ)
// var olDarieble = "Я переменная, объявленная с помощью var";

// 2. let (современный способ)
// let newVariable = "Я переменная, объявленная с помощью let";

// 3. const (способ для объявления неизменяемых переменных)
// const constantVariable = "Я константа, объявленная с помощью const";

// ЗАдание 2: переменные с 6 разными типами данных

// 1. string (строка) - используется для хранения текста
// const studentName = "Иван";

// 2. number (число) - используется для хранения числовых значений
// const studentAge = 20;

// 3. boolean (логический) - используется для хранения значений true или false
// const isStudent = true;

// 4. null (нулевое значение) - используется для явного указания на отсутствие значения
// const emptyValue = null;

// 5. undefined (неопределенное значение) - используется для обозначения переменной, которая была объявлена, но не присвоена значение
// let undefinedValue;

// 6. object (объект) - используется для хранения коллекций данных
// const studentInfo = {
    // name: "Иван",
    // age: 20,
    // isStudent: true
// };